MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define PDB0_SC                       (*((volatile uint32_t *)0x40036000))      // Status and Control register
#define PDB0_MOD                      (*((volatile uint32_t *)0x40036004))      // Modulus register
#define PDB0_CNT                      (*((volatile uint32_t *)0x40036008))      // Counter register
#define PDB0_IDLY                     (*((volatile uint32_t *)0x4003600C))      // Interrupt Delay register
#define PDB0_CH0C1                    (*((volatile uint32_t *)0x40036010))      // Channel n Control register 1
#define PDB0_CH0S                     (*((volatile uint32_t *)0x40036014))      // Channel n Status register
#define PDB0_CH0DLY0                  (*((volatile uint32_t *)0x40036018))      // Channel n Delay 0 register
#define PDB0_CH0DLY1                  (*((volatile uint32_t *)0x4003601C))      // Channel n Delay 1 register
#define PDB0_DACINTC0                 (*((volatile uint32_t *)0x40036150))      // DAC Interval Trigger n Control register
#define PDB0_DACINT0                  (*((volatile uint32_t *)0x40036154))      // DAC Interval n register
#define PDB0_POEN                     (*((volatile uint32_t *)0x40036190))      // Pulse-Out n Enable register
#define PDB0_PO0DLY                   (*((volatile uint32_t *)0x40036194))      // Pulse-Out n Delay register
#define PDB0_PO1DLY                   (*((volatile uint32_t *)0x40036198))      // Pulse-Out n Delay register


//*****************************************************************************
//
// Periodic Interrupt Timer (PIT) registers
//
//*****************************************************************************

#define PIT0_MCR                      (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register
#define PIT0_LTMR64H                  (*((volatile uint32_t *)0x400370E0))      // PIT Upper Lifetime Timer Register
#define PIT0_LTMR64L                  (*((volatile uint32_t *)0x400370E4))      // PIT Lower Lifetime Timer Register
#define PIT0_LDVAL0                   (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register
#define PIT0_CVAL0                    (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register
#define PIT0_TCTRL0                   (*((volatile uint32_t *)0x40037108))      // Timer Control Register
#define PIT0_TFLG0                    (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register
#define PIT0_LDVAL1                   (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register
#define PIT0_CVAL1                    (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register
#define PIT0_TCTRL1                   (*((volatile uint32_t *)0x40037118))      // Timer Control Register
#define PIT0_TFLG1                    (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register
#define PIT0_LDVAL2                   (*((volatile uint32_t *)0x40037120))      // Timer Load Value Register
#define PIT0_CVAL2                    (*((volatile uint32_t *)0x40037124))      // Current Timer Value Register
#define PIT0_TCTRL2                   (*((volatile uint32_t *)0x40037128))      // Timer Control Register
#define PIT0_TFLG2                    (*((volatile uint32_t *)0x4003712C))      // Timer Flag Register
#define PIT0_LDVAL3                   (*((volatile uint32_t *)0x40037130))      // Timer Load Value Register
#define PIT0_CVAL3                    (*((volatile uint32_t *)0x40037134))      // Current Timer Value Register
#define PIT0_TCTRL3                   (*((volatile uint32_t *)0x40037138))      // Timer Control Register
#define PIT0_TFLG3                    (*((volatile uint32_t *)0x4003713C))      // Timer Flag Register


//*****************************************************************************
//
// Real Time Clock (RTC) registers
//
//*****************************************************************************

#define RTC_TSR                       (*((volatile uint32_t *)0x4003D000))      // RTC Time Seconds Register
#define RTC_TPR                       (*((volatile uint32_t *)0x4003D004))      // RTC Time Prescaler Register
#define RTC_TAR                       (*((volatile uint32_t *)0x4003D008))      // RTC Time Alarm Register
#define RTC_TCR                       (*((volatile uint32_t *)0x4003D00C))      // RTC Time Compensation Register
#define RTC_CR                        (*((volatile uint32_t *)0x4003D010))      // RTC Control Register
#define RTC_SR                        (*((volatile uint32_t *)0x4003D014))      // RTC Status Register
#define RTC_LR                        (*((volatile uint32_t *)0x4003D018))      // RTC Lock Register
#define RTC_IER                       (*((volatile uint32_t *)0x4003D01C))      // RTC Interrupt Enable Register
#define RTC_WAR                       (*((volatile uint32_t *)0x4003D800))      // RTC Write Access Register
#define RTC_RAR                       (*((volatile uint32_t *)0x4003D804))      // RTC Read Access Register


//*****************************************************************************
//
// Universal Serial Bus Full Speed OTG Controller (USBFSOTG) registers
//
//*****************************************************************************

#define USB0_PERID                    (*((volatile uint32_t *)0x40072000))      // Peripheral ID register
#define USB0_IDCOMP                   (*((volatile uint32_t *)0x40072004))      // Peripheral ID Complement register
#define USB0_REV                      (*((volatile uint32_t *)0x40072008))      // Peripheral Revision register
#define USB0_ADDINFO                  (*((volatile uint32_t *)0x4007200C))      // Peripheral Additional Info register
#define USB0_OTGISTAT                 (*((volatile uint32_t *)0x40072010))      // OTG Interrupt Status register
#define USB0_OTGICR                   (*((volatile uint32_t *)0x40072014))      // OTG Interrupt Control register
#define USB0_OTGSTAT                  (*((volatile uint32_t *)0x40072018))      // OTG Status register
#define USB0_OTGCTL                   (*((volatile uint32_t *)0x4007201C))      // OTG Control register
#define USB0_ISTAT                    (*((volatile uint32_t *)0x40072080))      // Interrupt Status register
#define USB0_INTEN                    (*((volatile uint32_t *)0x40072084))      // Interrupt Enable register
#define USB0_ERRSTAT                  (*((volatile uint32_t *)0x40072088))      // Error Interrupt Status register
#define USB0_ERREN                    (*((volatile uint32_t *)0x4007208C))      // Error Interrupt Enable register
#define USB0_STAT                     (*((volatile uint32_t *)0x40072090))      // Status register
#define USB0_CTL                      (*((volatile uint32_t *)0x40072094))      // Control register
#define USB0_ADDR                     (*((volatile uint32_t *)0x40072098))      // Address register
#define USB0_BDTPAGE1                 (*((volatile uint32_t *)0x4007209C))      // BDT Page register 1
#define USB0_FRMNUML                  (*((volatile uint32_t *)0x400720A0))      // Frame Number register Low
#define USB0_FRMNUMH                  (*((volatile uint32_t *)0x400720A4))      // Frame Number register High
#define USB0_TOKEN                    (*((volatile uint32_t *)0x400720A8))      // Token register
#define USB0_SOFTHLD                  (*((volatile uint32_t *)0x400720AC))      // SOF Threshold register
#define USB0_BDTPAGE2                 (*((volatile uint32_t *)0x400720B0))      // BDT Page Register 2
#define USB0_BDTPAGE3                 (*((volatile uint32_t *)0x400720B4))      // BDT Page Register 3
#define USB0_ENDPT0                   (*((volatile uint32_t *)0x400720C0))      // Endpoint Control register
#define USB0_ENDPT1                   (*((volatile uint32_t *)0x400720C4))      // Endpoint Control register
#define USB0_ENDPT2                   (*((volatile uint32_t *)0x400720C8))      // Endpoint Control register
#define USB0_ENDPT3                   (*((volatile uint32_t *)0x400720CC))      // Endpoint Control register
#define USB0_ENDPT4                   (*((volatile uint32_t *)0x400720D0))      // Endpoint Control register
#define USB0_ENDPT5                   (*((volatile uint32_t *)0x400720D4))      // Endpoint Control register
#define USB0_ENDPT6                   (*((volatile uint32_t *)0x400720D8))      // Endpoint Control register
#define USB0_ENDPT7                   (*((volatile uint32_t *)0x400720DC))      // Endpoint Control register
#define USB0_ENDPT8                   (*((volatile uint32_t *)0x400720E0))      // Endpoint Control register
#define USB0_ENDPT9                   (*((volatile uint32_t *)0x400720E4))      // Endpoint Control register
#define USB0_ENDPT10                  (*((volatile uint32_t *)0x400720E8))      // Endpoint Control register
#define USB0_ENDPT11                  (*((volatile uint32_t *)0x400720EC))      // Endpoint Control register
#define USB0_ENDPT12                  (*((volatile uint32_t *)0x400720F0))      // Endpoint Control register
#define USB0_ENDPT13                  (*((volatile uint32_t *)0x400720F4))      // Endpoint Control register
#define USB0_ENDPT14                  (*((volatile uint32_t *)0x400720F8))      // Endpoint Control register
#define USB0_ENDPT15                  (*((volatile uint32_t *)0x400720FC))      // Endpoint Control register
#define USB0_USBCTRL                  (*((volatile uint32_t *)0x40072100))      // USB Control register
#define USB0_OBSERVE                  (*((volatile uint32_t *)0x40072104))      // USB OTG Observe register
#define USB0_CONTROL                  (*((volatile uint32_t *)0x40072108))      // USB OTG Control register
#define USB0_USBTRC0                  (*((volatile uint32_t *)0x4007210C))      // USB Transceiver Control register 0
#define USB0_USBFRMADJUST             (*((volatile uint32_t *)0x40072114))      // Frame Adjust Register
#define USB0_MISCCTRL                 (*((volatile uint32_t *)0x4007212C))      // Miscellaneous Control register
#define USB0_CLK_RECOVER_CTRL         (*((volatile uint32_t *)0x40072140))      // USB Clock recovery control
#define USB0_CLK_RECOVER_IRC_EN       (*((volatile uint32_t *)0x40072144))      // IRC48M oscillator enable register
#define USB0_CLK_RECOVER_INT_EN       (*((volatile uint32_t *)0x40072154))      // Clock recovery combined interrupt enable
#define USB0_CLK_RECOVER_INT_STATUS   (*((volatile uint32_t *)0x4007215C))      // Clock recovery separated interrupt status


//*****************************************************************************
//
// USB Device Charger Detection Module (USBDCD) registers
//
//*****************************************************************************

#define USBDCD_CONTROL                (*((volatile uint32_t *)0x40035000))      // Control register
#define USBDCD_CLOCK                  (*((volatile uint32_t *)0x40035004))      // Clock register
#define USBDCD_STATUS                 (*((volatile uint32_t *)0x40035008))      // Status register
#define USBDCD_SIGNAL_OVERRIDE        (*((volatile uint32_t *)0x4003500C))      // Signal Override Register
#define USBDCD_TIMER0                 (*((volatile uint32_t *)0x40035010))      // TIMER0 register
#define USBDCD_TIMER1                 (*((volatile uint32_t *)0x40035014))      // TIMER1 register
#define USBDCD_TIMER2_BC11            (*((volatile uint32_t *)0x40035018))      // TIMER2_BC11 register
#define USBDCD_TIMER2_BC12            (*((volatile uint32_t *)0x40035018))      // TIMER2_BC12 register


//*****************************************************************************
//
// USB High Speed OTG Controller (USBHS) registers
//
//*****************************************************************************

