MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define I2C0_A1                       (*((volatile uint32_t *)0x40066000))      // I2C Address Register 1 (I2C0_A1)
#define I2C0_F                        (*((volatile uint32_t *)0x40066001))      // I2C Frequency Divider register (I2C0_F)
#define I2C0_C1                       (*((volatile uint32_t *)0x40066002))      // I2C Control Register 1 (I2C0_C1)
#define I2C0_S                        (*((volatile uint32_t *)0x40066003))      // I2C Status register (I2C0_S)
#define I2C0_D                        (*((volatile uint32_t *)0x40066004))      // I2C Data I/O register (I2C0_D)
#define I2C0_C2                       (*((volatile uint32_t *)0x40066005))      // I2C Control Register 2 (I2C0_C2)
#define I2C0_FLT                      (*((volatile uint32_t *)0x40066006))      // I2C Programmable Input Glitch Filter Register (I2C0_FLT)
#define I2C0_RA                       (*((volatile uint32_t *)0x40066007))      // I2C Range Address register (I2C0_RA)
#define I2C0_SMB                      (*((volatile uint32_t *)0x40066008))      // I2C SMBus Control and Status register (I2C0_SMB)
#define I2C0_A2                       (*((volatile uint32_t *)0x40066009))      // I2C Address Register 2 (I2C0_A2)
#define I2C0_SLTH                     (*((volatile uint32_t *)0x4006600A))      // I2C SCL Low Timeout Register High (I2C0_SLTH)
#define I2C0_SLTL                     (*((volatile uint32_t *)0x4006600B))      // I2C SCL Low Timeout Register Low (I2C0_SLTL)
#define I2C0_S2                       (*((volatile uint32_t *)0x4006600C))      // I2C Status register 2 (I2C0_S2)
#define I2C1_A1                       (*((volatile uint32_t *)0x40067000))      // I2C Address Register 1 (I2C1_A1)
#define I2C1_F                        (*((volatile uint32_t *)0x40067001))      // I2C Frequency Divider register (I2C1_F)
#define I2C1_C1                       (*((volatile uint32_t *)0x40067002))      // I2C Control Register 1 (I2C1_C1)
#define I2C1_S                        (*((volatile uint32_t *)0x40067003))      // I2C Status register (I2C1_S)
#define I2C1_D                        (*((volatile uint32_t *)0x40067004))      // I2C Data I/O register (I2C1_D)
#define I2C1_C2                       (*((volatile uint32_t *)0x40067005))      // I2C Control Register 2 (I2C1_C2)
#define I2C1_FLT                      (*((volatile uint32_t *)0x40067006))      // I2C Programmable Input Glitch Filter Register (I2C1_FLT)
#define I2C1_RA                       (*((volatile uint32_t *)0x40067007))      // I2C Range Address register (I2C1_RA)
#define I2C1_SMB                      (*((volatile uint32_t *)0x40067008))      // I2C SMBus Control and Status register (I2C1_SMB)
#define I2C1_A2                       (*((volatile uint32_t *)0x40067009))      // I2C Address Register 2 (I2C1_A2)
#define I2C1_SLTH                     (*((volatile uint32_t *)0x4006700A))      // I2C SCL Low Timeout Register High (I2C1_SLTH)
#define I2C1_SLTL                     (*((volatile uint32_t *)0x4006700B))      // I2C SCL Low Timeout Register Low (I2C1_SLTL)
#define I2C1_S2                       (*((volatile uint32_t *)0x4006700C))      // I2C Status register 2 (I2C1_S2)
#define I2C2_A1                       (*((volatile uint32_t *)0x400E6000))      // I2C Address Register 1 (I2C2_A1)
#define I2C2_F                        (*((volatile uint32_t *)0x400E6001))      // I2C Frequency Divider register (I2C2_F)
#define I2C2_C1                       (*((volatile uint32_t *)0x400E6002))      // I2C Control Register 1 (I2C2_C1)
#define I2C2_S                        (*((volatile uint32_t *)0x400E6003))      // I2C Status register (I2C2_S)
#define I2C2_D                        (*((volatile uint32_t *)0x400E6004))      // I2C Data I/O register (I2C2_D)
#define I2C2_C2                       (*((volatile uint32_t *)0x400E6005))      // I2C Control Register 2 (I2C2_C2)
#define I2C2_FLT                      (*((volatile uint32_t *)0x400E6006))      // I2C Programmable Input Glitch Filter Register (I2C2_FLT)
#define I2C2_RA                       (*((volatile uint32_t *)0x400E6007))      // I2C Range Address register (I2C2_RA)
#define I2C2_SMB                      (*((volatile uint32_t *)0x400E6008))      // I2C SMBus Control and Status register (I2C2_SMB)
#define I2C2_A2                       (*((volatile uint32_t *)0x400E6009))      // I2C Address Register 2 (I2C2_A2)
#define I2C2_SLTH                     (*((volatile uint32_t *)0x400E600A))      // I2C SCL Low Timeout Register High (I2C2_SLTH)
#define I2C2_SLTL                     (*((volatile uint32_t *)0x400E600B))      // I2C SCL Low Timeout Register Low (I2C2_SLTL)
#define I2C2_S2                       (*((volatile uint32_t *)0x400E600C))      // I2C Status register 2 (I2C2_S2)
#define I2C3_A1                       (*((volatile uint32_t *)0x400E7000))      // I2C Address Register 1 (I2C3_A1)
#define I2C3_F                        (*((volatile uint32_t *)0x400E7001))      // I2C Frequency Divider register (I2C3_F)
#define I2C3_C1                       (*((volatile uint32_t *)0x400E7002))      // I2C Control Register 1 (I2C3_C1)
#define I2C3_S                        (*((volatile uint32_t *)0x400E7003))      // I2C Status register (I2C3_S)
#define I2C3_D                        (*((volatile uint32_t *)0x400E7004))      // I2C Data I/O register (I2C3_D)
#define I2C3_C2                       (*((volatile uint32_t *)0x400E7005))      // I2C Control Register 2 (I2C3_C2)
#define I2C3_FLT                      (*((volatile uint32_t *)0x400E7006))      // I2C Programmable Input Glitch Filter Register (I2C3_FLT)
#define I2C3_RA                       (*((volatile uint32_t *)0x400E7007))      // I2C Range Address register (I2C3_RA)
#define I2C3_SMB                      (*((volatile uint32_t *)0x400E7008))      // I2C SMBus Control and Status register (I2C3_SMB)
#define I2C3_A2                       (*((volatile uint32_t *)0x400E7009))      // I2C Address Register 2 (I2C3_A2)
#define I2C3_SLTH                     (*((volatile uint32_t *)0x400E700A))      // I2C SCL Low Timeout Register High (I2C3_SLTH)
#define I2C3_SLTL                     (*((volatile uint32_t *)0x400E700B))      // I2C SCL Low Timeout Register Low (I2C3_SLTL)
#define I2C3_S2                       (*((volatile uint32_t *)0x400E700C))      // I2C Status register 2 (I2C3_S2)


//*****************************************************************************
//
// Low Power Universal asynchronous receiver/transmitter (LPUART) registers
//
//*****************************************************************************

#define LPUART0_BAUD                  (*((volatile uint32_t *)0x400C4000))      // LPUART Baud Rate Register (LPUART0_BAUD)
#define LPUART0_STAT                  (*((volatile uint32_t *)0x400C4004))      // LPUART Status Register (LPUART0_STAT)
#define LPUART0_CTRL                  (*((volatile uint32_t *)0x400C4008))      // LPUART Control Register (LPUART0_CTRL)
#define LPUART0_DATA                  (*((volatile uint32_t *)0x400C400C))      // LPUART Data Register (LPUART0_DATA)
#define LPUART0_MATCH                 (*((volatile uint32_t *)0x400C4010))      // LPUART Match Address Register (LPUART0_MATCH)
#define LPUART0_MODIR                 (*((volatile uint32_t *)0x400C4014))      // LPUART Modem IrDA Register (LPUART0_MODIR)
#define LPUART0_FIFO                  (*((volatile uint32_t *)0x400C4018))      // LPUART FIFO Register (LPUART0_FIFO)
#define LPUART0_WATER                 (*((volatile uint32_t *)0x400C401C))      // LPUART Watermark Register (LPUART0_WATER)
#define LPUART1_BAUD                  (*((volatile uint32_t *)0x400C5000))      // LPUART Baud Rate Register (LPUART1_BAUD)
#define LPUART1_STAT                  (*((volatile uint32_t *)0x400C5004))      // LPUART Status Register (LPUART1_STAT)
#define LPUART1_CTRL                  (*((volatile uint32_t *)0x400C5008))      // LPUART Control Register (LPUART1_CTRL)
#define LPUART1_DATA                  (*((volatile uint32_t *)0x400C500C))      // LPUART Data Register (LPUART1_DATA)
#define LPUART1_MATCH                 (*((volatile uint32_t *)0x400C5010))      // LPUART Match Address Register (LPUART1_MATCH)
#define LPUART1_MODIR                 (*((volatile uint32_t *)0x400C5014))      // LPUART Modem IrDA Register (LPUART1_MODIR)
#define LPUART1_FIFO                  (*((volatile uint32_t *)0x400C5018))      // LPUART FIFO Register (LPUART1_FIFO)
#define LPUART1_WATER                 (*((volatile uint32_t *)0x400C501C))      // LPUART Watermark Register (LPUART1_WATER)
#define LPUART2_BAUD                  (*((volatile uint32_t *)0x400C6000))      // LPUART Baud Rate Register (LPUART2_BAUD)
#define LPUART2_STAT                  (*((volatile uint32_t *)0x400C6004))      // LPUART Status Register (LPUART2_STAT)
#define LPUART2_CTRL                  (*((volatile uint32_t *)0x400C6008))      // LPUART Control Register (LPUART2_CTRL)
#define LPUART2_DATA                  (*((volatile uint32_t *)0x400C600C))      // LPUART Data Register (LPUART2_DATA)
#define LPUART2_MATCH                 (*((volatile uint32_t *)0x400C6010))      // LPUART Match Address Register (LPUART2_MATCH)
#define LPUART2_MODIR                 (*((volatile uint32_t *)0x400C6014))      // LPUART Modem IrDA Register (LPUART2_MODIR)
#define LPUART2_FIFO                  (*((volatile uint32_t *)0x400C6018))      // LPUART FIFO Register (LPUART2_FIFO)
#define LPUART2_WATER                 (*((volatile uint32_t *)0x400C601C))      // LPUART Watermark Register (LPUART2_WATER)
#define LPUART3_BAUD                  (*((volatile uint32_t *)0x400C7000))      // LPUART Baud Rate Register (LPUART3_BAUD)
#define LPUART3_STAT                  (*((volatile uint32_t *)0x400C7004))      // LPUART Status Register (LPUART3_STAT)
#define LPUART3_CTRL                  (*((volatile uint32_t *)0x400C7008))      // LPUART Control Register (LPUART3_CTRL)
#define LPUART3_DATA                  (*((volatile uint32_t *)0x400C700C))      // LPUART Data Register (LPUART3_DATA)
#define LPUART3_MATCH                 (*((volatile uint32_t *)0x400C7010))      // LPUART Match Address Register (LPUART3_MATCH)
#define LPUART3_MODIR                 (*((volatile uint32_t *)0x400C7014))      // LPUART Modem IrDA Register (LPUART3_MODIR)
#define LPUART3_FIFO                  (*((volatile uint32_t *)0x400C7018))      // LPUART FIFO Register (LPUART3_FIFO)
#define LPUART3_WATER                 (*((volatile uint32_t *)0x400C701C))      // LPUART Watermark Register (LPUART3_WATER)
#define LPUART4_BAUD                  (*((volatile uint32_t *)0x400D6000))      // LPUART Baud Rate Register (LPUART4_BAUD)
#define LPUART4_STAT                  (*((volatile uint32_t *)0x400D6004))      // LPUART Status Register (LPUART4_STAT)
#define LPUART4_CTRL                  (*((volatile uint32_t *)0x400D6008))      // LPUART Control Register (LPUART4_CTRL)
#define LPUART4_DATA                  (*((volatile uint32_t *)0x400D600C))      // LPUART Data Register (LPUART4_DATA)
#define LPUART4_MATCH                 (*((volatile uint32_t *)0x400D6010))      // LPUART Match Address Register (LPUART4_MATCH)
#define LPUART4_MODIR                 (*((volatile uint32_t *)0x400D6014))      // LPUART Modem IrDA Register (LPUART4_MODIR)
#define LPUART4_FIFO                  (*((volatile uint32_t *)0x400D6018))      // LPUART FIFO Register (LPUART4_FIFO)
#define LPUART4_WATER                 (*((volatile uint32_t *)0x400D601C))      // LPUART Watermark Register (LPUART4_WATER)


//*****************************************************************************
//
// Integrated Interchip Sound (I2S) / Synchronous Audio Interface (SAI) registers
//
//*****************************************************************************

#define I2S0_TCSR                     (*((volatile uint32_t *)0x4002F000))      // SAI Transmit Control Register (I2S0_TCSR)
#define I2S0_TCR1                     (*((volatile uint32_t *)0x4002F004))      // SAI Transmit Configuration 1 Register (I2S0_TCR1)
#define I2S0_TCR2                     (*((volatile uint32_t *)0x4002F008))      // SAI Transmit Configuration 2 Register (I2S0_TCR2)
#define I2S0_TCR3                     (*((volatile uint32_t *)0x4002F00C))      // SAI Transmit Configuration 3 Register (I2S0_TCR3)
#define I2S0_TCR4                     (*((volatile uint32_t *)0x4002F010))      // SAI Transmit Configuration 4 Register (I2S0_TCR4)
#define I2S0_TCR5                     (*((volatile uint32_t *)0x4002F014))      // SAI Transmit Configuration 5 Register (I2S0_TCR5)
#define I2S0_TDR0                     (*((volatile uint32_t *)0x4002F020))      // SAI Transmit Data Register (I2S0_TDR0)
#define I2S0_TDR1                     (*((volatile uint32_t *)0x4002F024))      // SAI Transmit Data Register (I2S0_TDR1)
#define I2S0_TFR0                     (*((volatile uint32_t *)0x4002F040))      // SAI Transmit FIFO Register (I2S0_TFR0)
#define I2S0_TFR1                     (*((volatile uint32_t *)0x4002F044))      // SAI Transmit FIFO Register (I2S0_TFR1)
#define I2S0_TMR                      (*((volatile uint32_t *)0x4002F060))      // SAI Transmit Mask Register (I2S0_TMR)
#define I2S0_RCSR                     (*((volatile uint32_t *)0x4002F080))      // SAI Receive Control Register (I2S0_RCSR)
#define I2S0_RCR1                     (*((volatile uint32_t *)0x4002F084))      // SAI Receive Configuration 1 Register (I2S0_RCR1)
#define I2S0_RCR2                     (*((volatile uint32_t *)0x4002F088))      // SAI Receive Configuration 2 Register (I2S0_RCR2)
#define I2S0_RCR3                     (*((volatile uint32_t *)0x4002F08C))      // SAI Receive Configuration 3 Register (I2S0_RCR3)
#define I2S0_RCR4                     (*((volatile uint32_t *)0x4002F090))      // SAI Receive Configuration 4 Register (I2S0_RCR4)
#define I2S0_RCR5                     (*((volatile uint32_t *)0x4002F094))      // SAI Receive Configuration 5 Register (I2S0_RCR5)
#define I2S0_RDR0                     (*((volatile uint32_t *)0x4002F0A0))      // SAI Receive Data Register (I2S0_RDR0)
#define I2S0_RDR1                     (*((volatile uint32_t *)0x4002F0A4))      // SAI Receive Data Register (I2S0_RDR1)
#define I2S0_RFR0                     (*((volatile uint32_t *)0x4002F0C0))      // SAI Receive FIFO Register (I2S0_RFR0)
#define I2S0_RFR1                     (*((volatile uint32_t *)0x4002F0C4))      // SAI Receive FIFO Register (I2S0_RFR1)
#define I2S0_RMR                      (*((volatile uint32_t *)0x4002F0E0))      // SAI Receive Mask Register (I2S0_RMR)
#define I2S0_MCR                      (*((volatile uint32_t *)0x4002F100))      // SAI MCLK Control Register (I2S0_MCR)
#define I2S0_MDR                      (*((volatile uint32_t *)0x4002F104))      // SAI MCLK Divide Register (I2S0_MDR)
#define I2S1_TCSR                     (*((volatile uint32_t *)0x400AF000))      // SAI Transmit Control Register (I2S1_TCSR)
#define I2S1_TCR1                     (*((volatile uint32_t *)0x400AF004))      // SAI Transmit Configuration 1 Register (I2S1_TCR1)
#define I2S1_TCR2                     (*((volatile uint32_t *)0x400AF008))      // SAI Transmit Configuration 2 Register (I2S1_TCR2)
#define I2S1_TCR3                     (*((volatile uint32_t *)0x400AF00C))      // SAI Transmit Configuration 3 Register (I2S1_TCR3)
#define I2S1_TCR4                     (*((volatile uint32_t *)0x400AF010))      // SAI Transmit Configuration 4 Register (I2S1_TCR4)
#define I2S1_TCR5                     (*((volatile uint32_t *)0x400AF014))      // SAI Transmit Configuration 5 Register (I2S1_TCR5)
#define I2S1_TDR0                     (*((volatile uint32_t *)0x400AF020))      // SAI Transmit Data Register (I2S1_TDR0)
#define I2S1_TDR1                     (*((volatile uint32_t *)0x400AF024))      // SAI Transmit Data Register (I2S1_TDR1)
#define I2S1_TFR0                     (*((volatile uint32_t *)0x400AF040))      // SAI Transmit FIFO Register (I2S1_TFR0)
#define I2S1_TFR1                     (*((volatile uint32_t *)0x400AF044))      // SAI Transmit FIFO Register (I2S1_TFR1)
#define I2S1_TMR                      (*((volatile uint32_t *)0x400AF060))      // SAI Transmit Mask Register (I2S1_TMR)
#define I2S1_RCSR                     (*((volatile uint32_t *)0x400AF080))      // SAI Receive Control Register (I2S1_RCSR)
#define I2S1_RCR1                     (*((volatile uint32_t *)0x400AF084))      // SAI Receive Configuration 1 Register (I2S1_RCR1)
#define I2S1_RCR2                     (*((volatile uint32_t *)0x400AF088))      // SAI Receive Configuration 2 Register (I2S1_RCR2)
#define I2S1_RCR3                     (*((volatile uint32_t *)0x400AF08C))      // SAI Receive Configuration 3 Register (I2S1_RCR3)
#define I2S1_RCR4                     (*((volatile uint32_t *)0x400AF090))      // SAI Receive Configuration 4 Register (I2S1_RCR4)
#define I2S1_RCR5                     (*((volatile uint32_t *)0x400AF094))      // SAI Receive Configuration 5 Register (I2S1_RCR5)
#define I2S1_RDR0                     (*((volatile uint32_t *)0x400AF0A0))      // SAI Receive Data Register (I2S1_RDR0)
#define I2S1_RDR1                     (*((volatile uint32_t *)0x400AF0A4))      // SAI Receive Data Register (I2S1_RDR1)
#define I2S1_RFR0                     (*((volatile uint32_t *)0x400AF0C0))      // SAI Receive FIFO Register (I2S1_RFR0)
#define I2S1_RFR1                     (*((volatile uint32_t *)0x400AF0C4))      // SAI Receive FIFO Register (I2S1_RFR1)
#define I2S1_RMR                      (*((volatile uint32_t *)0x400AF0E0))      // SAI Receive Mask Register (I2S1_RMR)
#define I2S1_MCR                      (*((volatile uint32_t *)0x400AF100))      // SAI MCLK Control Register (I2S1_MCR)
#define I2S1_MDR                      (*((volatile uint32_t *)0x400AF104))      // SAI MCLK Divide Register (I2S1_MDR)


//*****************************************************************************
//
// Secured digital host controller (SDHC) registers
//
//*****************************************************************************

