MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define EEIn                          0x7FFFFFFF80000000      // Enable Error Interrupt n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CEEI register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAEE                          0x00000040      // Clear All Enable Error Interrupts
#define CEEIn                         0x000007E0      // Clear Enable Error Interrupt n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SEEI register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAEE                          0x00000040      // Sets All Enable Error Interrupts
#define SEEIn                         0x000007E0      // Set Enable Error Interrupt n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CERQ register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAER                          0x00000040      // Clear All Enable Requests
#define CERQn                         0x000007E0      // Clear Enable Request n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SERQ register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAER                          0x00000040      // Set All Enable Requests
#define SERQn                         0x000007E0      // Set Enable Request n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CDNE register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CADN                          0x00000040      // Clears All DONE Bits
#define CDNE                          0x000007E0      // Clear DONE Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_SSRT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define SAST                          0x00000040      // Set All START Bits (activates all channels)
#define SSRT                          0x000007E0      // Set START Bit


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CERR register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAEI                          0x00000040      // Clear All Error Indicators
#define CERRn                         0x000007E0      // Clear Error Indicator


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_CINT register.
//
//*****************************************************************************

#define NOP                           0x00000080      // No Op enable
#define CAIR                          0x00000040      // Clear All Interrupt Requests
#define CINTn                         0x000007E0      // Clear Interrupt Request


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_INT register.
//
//*****************************************************************************

#define INTn                          0x7FFFFFFF80000000      // Interrupt Request n


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_ERR register.
//
//*****************************************************************************

#define ERRn                          0x7FFFFFFF80000000      // Error In Channel n
#define ERR31                         0x80000000      // Error In Channel 31
#define ERR30                         0x40000000      // Error In Channel 30
#define ERR29                         0x20000000      // Error In Channel 29
#define ERR28                         0x10000000      // Error In Channel 28
#define ERR27                         0x08000000      // Error In Channel 27
#define ERR26                         0x04000000      // Error In Channel 26
#define ERR25                         0x02000000      // Error In Channel 25
#define ERR24                         0x01000000      // Error In Channel 24
#define ERR23                         0x00800000      // Error In Channel 23
#define ERR22                         0x00400000      // Error In Channel 22
#define ERR21                         0x00200000      // Error In Channel 21
#define ERR20                         0x00100000      // Error In Channel 20
#define ERR19                         0x00080000      // Error In Channel 19
#define ERR18                         0x00040000      // Error In Channel 18
#define ERR17                         0x00020000      // Error In Channel 17
#define ERR16                         0x00010000      // Error In Channel 16
#define ERR15                         0x00008000      // Error In Channel 15
#define ERR14                         0x00004000      // Error In Channel 14
#define ERR13                         0x00002000      // Error In Channel 13
#define ERR12                         0x00001000      // Error In Channel 12
#define ERR11                         0x00000800      // Error In Channel 11
#define ERR10                         0x00000400      // Error In Channel 10
#define ERR9                          0x00000200      // Error In Channel 9
#define ERR8                          0x00000100      // Error In Channel 8
#define ERR7                          0x00000080      // Error In Channel 7
#define ERR6                          0x00000040      // Error In Channel 6
#define ERR5                          0x00000020      // Error In Channel 5
#define ERR4                          0x00000010      // Error In Channel 4
#define ERR3                          0x00000008      // Error In Channel 3
#define ERR2                          0x00000004      // Error In Channel 2
#define ERR1                          0x00000002      // Error In Channel 1
#define ERR0                          0x00000001      // Error In Channel 0


//*****************************************************************************
//
// The following are defines for the bit fields in the DMA_HRS register.
//
//*****************************************************************************

