MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry
#define data[95:64]                   0x800000000000000000000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry
#define data[63:32]                   0x8000000000000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW2SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry
#define data[31:0]                    0x80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnUM register.
//
//*****************************************************************************

#define data[127:96]                  0x7FFFFFFF80000000      // Bits [127:96] of data entry
#define data[127:96]                  0x80000000000000000000000000000000      // Bits [127:96] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnMU register.
//
//*****************************************************************************

#define data[95:64]                   0x7FFFFFFF80000000      // Bits [95:64] of data entry
#define data[95:64]                   0x800000000000000000000000      // Bits [95:64] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnML register.
//
//*****************************************************************************

#define data[63:32]                   0x7FFFFFFF80000000      // Bits [63:32] of data entry
#define data[63:32]                   0x8000000000000000      // Bits [63:32] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the FMC_DATAW3SnLM register.
//
//*****************************************************************************

#define data[31:0]                    0x7FFFFFFF80000000      // Bits [31:0] of data entry ::
#define data[31:0]                    0x80000000      // Bits [31:0] of data entry


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_CTRL register.
//
//*****************************************************************************

#define IS                            0x00000800      // Initiate self-refresh command.
#define RTIM                          0x00000C00      // Refresh timing
#define RC                            0x0001FF00      // Refresh count


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_ACn register.
//
//*****************************************************************************

#define BA                            0x1FFF80000000      // Base address register.
#define RE                            0x00008000      // Refresh enable
#define CASL                          0x00006000      // CAS Latency
#define CBM                           0x00001C00      // Command bit location
#define IMRS                          0x00000040      // Initiate mode register set (mrs) command.
#define PS                            0x00000060      // Port size.
#define IP                            0x00000008      // Initiate precharge all (pall) command.


//*****************************************************************************
//
// The following are defines for the bit fields in the SDRAM_CMn register.
//
//*****************************************************************************

#define BAM                           0x1FFF80000000      // Base address mask.
#define WP                            0x00000100      // Write protect.
#define V                             0x00000001      // Valid.


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSARn register.
//
//*****************************************************************************

#define BA                            0x7FFF80000000      // Base Address


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSMRn register.
//
//*****************************************************************************

#define BAM                           0x7FFF80000000      // Base Address Mask
#define WP                            0x00000100      // Write Protect
#define V                             0x00000001      // Valid


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSCRn register.
//
//*****************************************************************************

#define SWS                           0x1F80000000      // Secondary Wait States
#define SWSEN                         0x00800000      // Secondary Wait State Enable
#define EXTS                          0x00400000      // Extended Transfer Start/Extended Address Latch Enable
#define ASET                          0x00600000      // Address Setup
#define RDAH                          0x00180000      // Read Address Hold or Deselect
#define WRAH                          0x00060000      // Write Address Hold or Deselect
#define WS                            0x001F8000      // Wait States
#define BLS                           0x00000200      // Byte-Lane Shift
#define AA                            0x00000100      // Auto-Acknowledge Enable
#define PS                            0x00000180      // Port Size
#define BEM                           0x00000020      // Byte-Enable Mode
#define BSTR                          0x00000010      // Burst-Read Enable
#define BSTW                          0x00000008      // Burst-Write Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the FB_CSPMCR register.
//
//*****************************************************************************

#define GROUP1                        0x780000000      // FlexBus Signal Group 1 Multiplex control
#define GROUP2                        0x78000000      // FlexBus Signal Group 2 Multiplex control


//*****************************************************************************
//
// The following are defines for the bit fields in the CRC_DATA register.
//
//*****************************************************************************

