MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define DMA                           0x00000100      // DMA Enable
#define TOF                           0x00000080      // Timer Overflow Flag
#define TOIE                          0x00000040      // Timer Overflow Interrupt Enable
#define CPWMS                         0x00000020      // Center-Aligned PWM Select
#define CMOD                          0x00000030      // Clock Mode Selection
#define PS                            0x0000001C      // Prescale Factor Selection


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CNT register.
//
//*****************************************************************************

#define COUNT                         0x7FFF8000      // Counter value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_MOD register.
//
//*****************************************************************************

#define MOD                           0x7FFF8000      // Modulo value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnSC register.
//
//*****************************************************************************

#define CHF                           0x00000080      // Channel Flag
#define CHIE                          0x00000040      // Channel Interrupt Enable
#define MSB                           0x00000020      // Channel Mode Select
#define MSA                           0x00000010      // Channel Mode Select
#define ELSB                          0x00000008      // Edge or Level Select
#define ELSA                          0x00000004      // Edge or Level Select
#define DMA                           0x00000001      // DMA Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CnV register.
//
//*****************************************************************************

#define VAL                           0x7FFF8000      // Channel Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_STATUS register.
//
//*****************************************************************************

#define TOF                           0x00000100      // Timer Overflow Flag
#define CH1F                          0x00000002      // Channel 1 Flag
#define CH0F                          0x00000001      // Channel 0 Flag


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_COMBINE register.
//
//*****************************************************************************

#define COMSWAP0                      0x00000002      // Combine Channel 0 and 1 Swap
#define COMBINE0                      0x00000001      // Combine Channels 0 and 1


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_POL register.
//
//*****************************************************************************

#define POL1                          0x00000002      // Channel 1 Polarity
#define POL0                          0x00000001      // Channel 0 Polarity


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_FILTER register.
//
//*****************************************************************************

#define CH1FVAL                       0x00000780      // Channel 1 Filter Value
#define CH0FVAL                       0x00000078      // Channel 0 Filter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_QDCTRL register.
//
//*****************************************************************************

#define QUADMODE                      0x00000008      // Quadrature Decoder Mode
#define QUADIR                        0x00000004      // Counter Direction in Quadrature Decode Mode
#define TOFDIR                        0x00000002      // Indicates if the TOF bit was set on the top or the bottom of counting
#define QUADEN                        0x00000001      // Enables the quadrature decoder mode


//*****************************************************************************
//
// The following are defines for the bit fields in the TPMx_CONF register.
//
//*****************************************************************************

#define TRGSEL                        0x78000000      // Trigger Select
#define TRGSRC                        0x00800000      // Trigger Source
#define TRGPOL                        0x00400000      // Trigger Polarity
#define CROT                          0x00200000      // Counter Reset on Trigger
#define CSOO                          0x00100000      // Counter Start on Overflow
#define CPOT                          0x00080000      // Counter Pause on Trigger
#define CSOT                          0x00040000      // Counter Stop on Overflow
#define GTBEEN                        0x00020000      // Global Time Base Enable
#define GTBSYNC                       0x00010000      // Global Time Base Synchronization
#define DBGMODE                       0x00018000      // Debug Mode ::


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_PSR register.
//
//*****************************************************************************

#define PRESCALE                      0x000003C0      // Configures the size of the Prescaler in Time Counter mode or width of the glitch filter in Pulse Counter mode
#define PBYP                          0x00000004      // Prescaler Bypass
#define PCS                           0x00000006      // Prescaler Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CMR register.
//
//*****************************************************************************

#define COMPARE                       0x7FFF8000      // Compare Value


//*****************************************************************************
//
// The following are defines for the bit fields in the LPTMRx_CNR register.
//
//*****************************************************************************

#define COUNTER                       0x7FFF8000      // Counter Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGH1 register.
//
//*****************************************************************************

#define PH                            0x00007F80      // Primary Carrier High Time Data Value


//*****************************************************************************
//
// The following are defines for the bit fields in the CMT_CGL1 register.
//
//*****************************************************************************

