MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define Reserved                      0xFFFFFFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCIVERSION register.
//
//*****************************************************************************

#define HCIVERSION                    0x7FFF80000000      // EHCI revision number


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCSPARAMS register.
//
//*****************************************************************************

#define Reserved                      0x780000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_HCCPARAMS register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DCIVERSION register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DCCPARAMS register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBCMD register.
//
//*****************************************************************************

#define Reserved                      0x7F80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBSTS register.
//
//*****************************************************************************

#define Reserved                      0x1F80000000      // This field is reserved.
#define TI1                           0x02000000      // General purpose Timer 1 Interrupt
#define TI0                           0x01000000      // General purpose Timer 0 Interrupt
#define UPI                           0x00080000      // USB host Periodic Interrupt
#define UAI                           0x00040000      // USB host Asynchronous Interrupt
#define NAKI                          0x00010000      // NAK Interrupt
#define AS                            0x00008000      // Asynchronous schedule Status
#define PS                            0x00004000      // Periodic schedule Status
#define RCL                           0x00002000      // Reclamation
#define HCH                           0x00001000      // Host Controller Halted
#define SLI                           0x00000200      // Sleep (DC suspend)
#define URI                           0x00000080      // USB Reset received
#define AAI                           0x00000040      // Interrupt on Async Advance
#define SEI                           0x00000020      // System Error
#define FRI                           0x00000008      // Frame-list Rollover
#define PCI                           0x00000004      // Port Change detect
#define UEI                           0x00000002      // USB Error Interrupt
#define UI                            0x00000001      // USB Interrupt (USBINT)


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBINTR register.
//
//*****************************************************************************

#define Reserved                      0x1F80000000      // This field is reserved.
#define TIE1                          0x02000000      // General purpose Timer 1 Interrupt Enable
#define TIE0                          0x01000000      // General purpose Timer 0 Interrupt Enable
#define UPIE                          0x00080000      // USB host Periodic Interrupt Enable
#define UAIE                          0x00040000      // USB host Asynchronous Interrupt Enable
#define NAKE                          0x00010000      // NAK Interrupt Enable
#define SLE                           0x00000100      // Sleep (DC suspend) Enable
#define SRE                           0x00000080      // SOF-Received Enable
#define URE                           0x00000040      // USB-Reset Enable
#define AAE                           0x00000020      // Interrupt on Async advance Enable
#define SEE                           0x00000010      // System Error Enable
#define FRE                           0x00000008      // Frame list Rollover Enable
#define PCE                           0x00000004      // Port Change detect Enable
#define UEE                           0x00000002      // USB Error interrupt Enable
#define UE                            0x00000001      // USB interrupt Enable


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_FRINDEX register.
//
//*****************************************************************************

#define Reserved                      0x1FFFF80000000      // This field is reserved.
#define FRINDEX                       0x1FFFC000      // Frame Index


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_PERIODICLISTBASE register.
//
//*****************************************************************************

#define Reserved                      0x7FFFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_DEVICEADDR register.
//
//*****************************************************************************

