MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MK28FN2M0CAU15/mcu.h
#define Reserved                      0x3F80000000      // This field is reserved.
#define USBADRA                       0x01000000      // Device Address Advance


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ASYNCLISTADDR register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFF80000000      // This field is reserved.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_TTCTRL register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This field is reserved.
#define TTHA                          0x1FC0000000      // TT Hub Address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_BURSTSIZE register.
//
//*****************************************************************************

#define Reserved                      0x7FFF80000000      // This field is reserved.
#define TXPBURST                      0x007F8000      // Programable TX Burst length
#define RXPBURST                      0x00007F80      // Programable RX Burst length


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_TXFILLTUNING register.
//
//*****************************************************************************

#define Reserved                      0x1FF80000000      // This field is reserved.
#define TXFIFOTHRES                   0x07E00000      // FIFO burst Threshold
#define TXSCHHEALTH                   0x0001F000      // Scheduler Health counter
#define TXSCHOH                       0x00007F80      // Scheduler Overhead


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ENDPTNAK register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define EPTN                          0x00780000      // TX Endpoint NAK
#define EPRN                          0x07FF8000      // RX Endpoint NAK


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_ENDPTNAKEN register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define EPTNE                         0x00780000      // TX Endpoint NAK
#define EPRNE                         0x07FF8000      // RX Endpoint NAK


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_CONFIGFLAG register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFFF80000000      // This field is reserved.
#define                               0x00000001      // Reserved


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_PORTSC1 register.
//
//*****************************************************************************

#define PTS[1:0]                      0x180000000      // Port Transceiver Select [1:0]
#define PSPD                          0x18000000      // Port Speed
#define PTS2                          0x02000000      // Port Transceiver Select [2]
#define PFSC                          0x01000000      // Port force Full-Speed Connect
#define PHCD                          0x00800000      // PHY low power suspend
#define WKOC                          0x00400000      // Wake on Over-Current enable
#define WKDS                          0x00200000      // Wake on Disconnect enable
#define WKCN                          0x00100000      // Wake on Connect enable
#define PTC                           0x00780000      // Port Test Control
#define PIC                           0x00018000      // Port Indicator Control
#define PO                            0x00002000      // Port Owner
#define PP                            0x00001000      // Port Power
#define LS                            0x00001800      // Line Status
#define HSP                           0x00000200      // High Speed Port
#define PR                            0x00000100      // Port Reset
#define SUSP                          0x00000080      // Suspend
#define FPR                           0x00000040      // Force Port Resume
#define OCC                           0x00000020      // Over-Current Change
#define OCA                           0x00000010      // Over-current active
#define PEC                           0x00000008      // Port Enable/disable Change
#define PE                            0x00000004      // Port Enabled/disabled
#define CSC                           0x00000002      // Connect Change Status
#define CCS                           0x00000001      // Current Connect Status


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_OTGSC register.
//
//*****************************************************************************

#define Reserved                      0x80000000      // This field is reserved.
#define DPIE                          0x40000000      // Data Pulse Interrupt Enable
#define MSE                           0x20000000      // 1 Milli-Second timer interrupt Enable
#define BSEIE                         0x10000000      // B Session End Interrupt Enable
#define BSVIE                         0x08000000      // B Session Valid Interrupt Enable
#define ASVIE                         0x04000000      // A Session Valid Interrupt Enable
#define AVVIE                         0x02000000      // A VBUS Valid Interrupt Enable
#define IDIE                          0x01000000      // USB ID Interrupt Enable
#define DPIS                          0x00400000      // Data Pulse interrupt Status
#define MSS                           0x00200000      // 1 Milli-Second timer interrupt Status
#define BSEIS                         0x00100000      // B Session End Interrupt Status
#define BSVIS                         0x00080000      // B Session Valid Interrupt Status
#define ASVIS                         0x00040000      // A Session Valid Interrupt Status
#define AVVIS                         0x00020000      // A VBUS Valid Interrupt Status
#define IDIS                          0x00010000      // USB ID Interrupt Status
#define DPS                           0x00004000      // Data bus Pulsing Status
#define MST                           0x00002000      // 1 Milli-Second timer Toggle
#define BSE                           0x00001000      // B Session End
#define BSV                           0x00000800      // B Session Valid
#define ASV                           0x00000400      // A Session Valid
#define AVV                           0x00000200      // A VBus Valid
#define ID                            0x00000100      // USB ID
#define HABA                          0x00000080      // Hardware Assist B-Disconnect to A-connect
#define IDPU                          0x00000020      // ID Pull-Up
#define DP                            0x00000010      // Data Pulsing
#define OT                            0x00000008      // OTG Termination
#define HAAR                          0x00000004      // Hardware Assist Auto-Reset
#define VC                            0x00000002      // VBUS Charge
#define VD                            0x00000001      // VBUS Discharge


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBMODE register.
//
//*****************************************************************************

#define Reserved                      0xFFFF80000000      // This field is reserved.
#define TXHSD                         0x0001C000      // Tx to Tx HS Delay
#define SDIS                          0x00000010      // Stream DISable
#define SLOM                          0x00000008      // Setup Lock-Out Mode
#define ES                            0x00000004      // Endian Select
#define CM                            0x00000006      // Controller Mode


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPSETUPSR register.
//
//*****************************************************************************

#define Reserved                      0x7FFFFFF80000000      // This field is reserved.
#define EPSETUPSTAT                   0x00000078      // Setup Endpoint Status


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPPRIME register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define PETB                          0x00780000      // Prime Endpoint tTansmit Buffer
#define PERB                          0x00000078      // Prime Endpoint Receive Buffer


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPFLUSH register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define FETB                          0x00780000      // Flush Endpoint Transmit Buffer
#define FERB                          0x00000078      // Flush Endpoint Receive Buffer


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPSR register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define ETBR                          0x00780000      // Endpoint Transmit Buffer Ready
#define ERBR                          0x00000078      // Endpoint Receive Buffer Ready


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPCOMPLETE register.
//
//*****************************************************************************

#define Reserved                      0x7FF80000000      // This field is reserved.
#define ETCE                          0x00780000      // Endpoint Transmit Complete Event
#define ERCE                          0x00000078      // Endpoint Receive Complete Event


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPCR0 register.
//
//*****************************************************************************

#define Reserved                      0x7F80000000      // This field is reserved.
#define TXE                           0x00800000      // TX Endpoint Enable
#define TXS                           0x00020000      // TX Endpoint Stall
#define RXE                           0x00000080      // RX endpoint Enable
#define RXS                           0x00000001      // RX endpoint Stall


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPCRn register.
//
//*****************************************************************************

#define Reserved                      0x7F80000000      // This field is reserved.
#define TXE                           0x00800000      // TX endpoint Enable
#define TXR                           0x00400000      // TX data toggle Reset
#define TXI                           0x00200000      // TX data toggle Inhibit
#define TXT                           0x00180000      // TX endpoint Type
#define TXS                           0x00020000      // TX endpoint Stall
#define RXE                           0x00000080      // RX endpoint Enable
#define RXR                           0x00000040      // RX data toggle Reset
#define RXI                           0x00000020      // RX data toggle Inhibit
#define RXT                           0x00000018      // RX endpoint Type
#define RXS                           0x00000001      // RX endpoint Stall


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_USBGENCTRL register.
//
//*****************************************************************************

#define Reserved                      0x1FFFFFF80000000      // This field is reserved.
#define WU_INT_CLR                    0x00000020      // Wakeup Interrupt Clear


//*****************************************************************************
//
// The following are defines for the bit fields in the USBHS_EPLISTADDR register.
//
//*****************************************************************************

#define EPBASE                        0xFFFFF80000000      // Endpoint list address


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_PWDn register.
//
//*****************************************************************************

#define RXPWDRX                       0x00100000      // Power-down the entire USB PHY receiver block except for the full-speed differential receiver
#define RXPWDDIFF                     0x00080000      // Power-down the USB high-speed differential receiver
#define RXPWD1PT1                     0x00040000      // Power-down the USB full-speed differential receiver
#define RXPWDENV                      0x00020000      // Power-down the USB high-speed receiver envelope detector (squelch signal)
#define TXPWDV2I                      0x00001000      // Power-down the USB PHY transmit V-to-I converter and the current mirror
#define TXPWDIBIAS                    0x00000800      // Power-down the USB PHY current bias block for the transmitter
#define TXPWDFS                       0x00000400      // Power-down the USB full-speed drivers


//*****************************************************************************
//
// The following are defines for the bit fields in the USBPHY_TXn register.
//
//*****************************************************************************

